app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "jvqrz"], ["user_id", 1], ["created_at", "2015-05-29 12:19:54.623864"], ["updated_at", "2015-05-29 12:19:54.623864"]]