app/controllers/comments_controller.rb

INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "rsk"], ["body", "body"], ["article_id", 20], ["created_at", "2015-05-19 13:01:23.209759"], ["updated_at", "2015-05-19 13:01:23.209759"]]
---
  def create
    @comment = @article.comments.create(comment_params)